---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostWallError
source: html/994270db-c4ee-d5de-fc3a-0d63efcb7b00.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostWallError Property

Rebar Cover Interior and Exterior are too large for host.

## Syntax (C#)
```csharp
public static FailureDefinitionId ThinHostWallError { get; }
```